title: Cisco File Deletion
description: See what files are being deleted from flash file systems
level: medium
status: experimental
falsepositives:
    - Will be used sometimes by admins to clean up local flash space
author: Austin Clark
date: 2019/08/12

logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'erase'
        - 'delete'
        - 'format'
    condition: keywords

id: 71d65515-c436-43c0-841b-236b1f32c21e
tags:
    - attack.defense_evasion
    - attack.impact
    - attack.t1070.004
    - attack.t1107 # an old one
    - attack.t1487 # an old one
    - attack.t1488 # an old one
    - attack.t1561.001
    - attack.t1561.002

