title: Cisco Collect Data
id: cd072b25-a418-4f98-8ebc-5093fb38fe1a
description: Collect pertinent data from the configuration files
author: Austin Clark
date: 2019/08/11
modified: 2020/09/02

logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - src
    - CmdSet
    - User
    - Privilege_Level
    - Remote_Address
detection:
    keywords:
        - 'show running-config'
        - 'show startup-config'
        - 'show archive config'
        - 'more'
    condition: keywords

tags:
    - attack.collection
    - attack.credential_access
    - attack.discovery
    - attack.t1003 # an old one
    - attack.t1005
    - attack.t1081 # an old one
    - attack.t1087 # an old one
    - attack.t1087.001
    - attack.t1552.001
level: low
status: experimental
falsepositives:
    - Commonly run by administrators

