title: Cisco Sniffing
description: Show when a monitor or a span/rspan is setup or modified
level: medium
status: experimental
falsepositives:
    - Admins may setup new or modify old spans, or use a monitor for troubleshooting
author: Austin Clark
date: 2019/08/11

logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'monitor capture point'
        - 'set span'
        - 'set rspan'
    condition: keywords

id: b9e1f193-d236-4451-aaae-2f3d2102120d
tags:
    - attack.credential_access
    - attack.discovery
    - attack.t1040

