title: Cisco Crypto Commands
description: Show when private keys are being exported from the device, or when new certificates are installed
level: high
status: experimental
falsepositives:
    - Not commonly run by administrators. Also whitelist your known good certificates
author: Austin Clark
date: 2019/08/12

logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - src
    - CmdSet
    - User
    - Privilege_Level
    - Remote_Address
detection:
    keywords:
        - 'crypto pki export'
        - 'crypto pki import'
        - 'crypto pki trustpoint'
    condition: keywords

id: 1f978c6a-4415-47fb-aca5-736a44d7ca3d
tags:
    - attack.credential_access
    - attack.defense_evasion
    - attack.t1130 # an old one
    - attack.t1145 # an old one
    - attack.t1552.004
    - attack.t1553.004

