title: PowerShell Create Local User
description: Detects creation of a local user via PowerShell
level: medium
status: experimental
falsepositives:
    - Legitimate user creation
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1136/T1136.md
author: '@ROxPinTeddy'
date: 2020/04/11

logsource:
    product: windows
    service: powershell
detection:
    selection:
        EventID: 4104
        Message|contains:
            - 'New-LocalUser'
    condition: selection

id: 243de76f-4725-4f2e-8225-a8a69b15ad61
modified: 2020/08/24
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059.001
    - attack.t1086 # an old one
    - attack.t1136 # an old one    
    - attack.t1136.001

