title: NTFS Alternate Data Stream
description: Detects writing data into NTFS alternate data streams from powershell. Needs Script Block Logging.
level: high
status: experimental
falsepositives:
    - unknown
references:
    - http://www.powertheshell.com/ntfsstreams/
author: Sami Ruohonen
date: 2018/07/24

logsource:
    product: windows
    service: powershell
    definition: 'It is recommended to use the new "Script Block Logging" of PowerShell v5 https://adsecurity.org/?p=2277'
detection:
    keyword1:
        - "set-content"
        - "add-content"
    keyword2:
        - "-stream"
    condition: keyword1 and keyword2

id: 8c521530-5169-495d-a199-0a3a881ad24e
modified: 2020/08/24
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one
    - attack.t1096 # an old one
    - attack.t1564.004

