title: PowerShell Called from an Executable Version Mismatch
description: Detects PowerShell called from an executable by the version mismatch method
level: high
status: experimental
falsepositives:
    - Penetration Tests
    - Unknown
references:
    - https://adsecurity.org/?p=2921
author: Sean Metcalf (source), Florian Roth (rule)
date: 2017/03/05

logsource:
    product: windows
    service: powershell-classic
detection:
    selection1:
        EventID: 400
        EngineVersion:
            - '2.*'
            - '4.*'
            - '5.*'
        HostVersion: '3.*'
    condition: selection1

id: c70e019b-1479-4b65-b0cc-cd0c6093a599
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one

