title: PowerShell ShellCode
description: Detects Base64 encoded Shellcode
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/cyb3rops/status/1063072865992523776
author: David Ledbetter (shellcode), Florian Roth (rule)
date: 2018/11/17

logsource:
    product: windows
    service: powershell
    definition: 'Script block logging must be enabled'
detection:
    selection:
        EventID: 4104
    keyword1:
        - '*AAAAYInlM*'
    keyword2:
        - '*OiCAAAAYInlM*'
        - '*OiJAAAAYInlM*'
    condition: selection and keyword1 and keyword2

id: 16b37b70-6fcf-4814-a092-c36bd3aafcbd
modified: 2020/08/24
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.privilege_escalation
    - attack.t1055
    - attack.t1059.001
    - attack.t1086 #an old one

