title: Dnscat Execution
id: a6d67db4-6220-436d-8afc-f3842fe05d43
description: Dnscat exfiltration tool execution

author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
modified: 2020/08/24
logsource:
    product: windows
    service: powershell
detection:
    selection:
        EventID: 4104
        ScriptBlockText|contains: "Start-Dnscat2"
    condition: selection

tags:
    - attack.execution
    - attack.exfiltration
    - attack.t1048
    - attack.t1059.001
    - attack.t1086 # an old one
level: critical
status: experimental
falsepositives:
    - Legitimate usage of PowerShell Dnscat2 — DNS Exfiltration tool (unlikely)

