title: Remote PowerShell Session
description: Detects remote PowerShell sessions
level: high
status: experimental
falsepositives:
    - Legitimate use remote PowerShell sessions
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
modified: 2020/08/24

logsource:
    product: windows
    service: powershell
detection:
    selection:
        EventID:
            - 4103
            - 400
        HostName: 'ServerRemoteHost'
        HostApplication|contains: 'wsmprovhost.exe'
    condition: selection

id: 96b9f619-aa91-478f-bacb-c3e50f8df575
tags:
    - attack.execution
    - attack.lateral_movement
    - attack.t1021.006
    - attack.t1028 #an old one
    - attack.t1059.001
    - attack.t1086 #an old one

