title: PowerShell PSAttack
description: Detects the use of PSAttack PowerShell hack tool
level: high
status: experimental
falsepositives:
    - Pentesters
references:
    - https://adsecurity.org/?p=2921
author: Sean Metcalf (source), Florian Roth (rule)
date: 2017/03/05

logsource:
    product: windows
    service: powershell
    definition: 'It is recommended to use the new "Script Block Logging" of PowerShell v5 https://adsecurity.org/?p=2277'
detection:
    selection:
        EventID: 4103
    keyword:
        - 'PS ATTACK!!!'
    condition: all of them

id: b7ec41a4-042c-4f31-a5db-d0fcde9fa5c5
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1086 #an old one

