title: Mimikatz Detection LSASS Access
description: Detects process access to LSASS which is typical for Mimikatz (0x1000 PROCESS_QUERY_ LIMITED_INFORMATION, 0x0400 PROCESS_QUERY_ INFORMATION "only old versions", 0x0010 PROCESS_VM_READ)
level: high
status: experimental
falsepositives:
    - Some security products access LSASS in this way.
references:
    - https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
    - https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
author: Sherif Eldeeb
date: 2017/10/18

logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 10
        TargetImage: 'C:\windows\system32\lsass.exe'
        GrantedAccess:
            - '0x1410'
            - '0x1010'
    condition: selection

id: 0d894093-71bc-43c3-8c4d-ecfc28dcf5d9
fields:
    - ComputerName
    - User
    - SourceImage
tags:
    - attack.credential_access
    - attack.s0002
    - attack.t1003
    - car.2019-04-004

