title: Mimikatz through Windows Remote Management
description: Detects usage of mimikatz through WinRM protocol by monitoring access to lsass process by wsmprovhost.exe.
level: high
status: stable
falsepositives:
    - low
references:
    - https://pentestlab.blog/2018/05/15/lateral-movement-winrm/
author: Patryk Prauze - ING Tech
date: 2019/05/20
modified: 2020/08/24

logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage: 'C:\windows\system32\lsass.exe'
        SourceImage: 'C:\Windows\system32\wsmprovhost.exe'
    condition: selection

id: aa35a627-33fb-4d04-a165-d33b4afca3e8
tags:
    - attack.credential_access
    - attack.execution
    - attack.lateral_movement
    - attack.s0002
    - attack.t1003 #an old one
    - attack.t1003.001
    - attack.t1021.006
    - attack.t1028 #an old one
    - attack.t1059.001
    - attack.t1086 #an old one

