title: VBA DLL Loaded Via Microsoft Word
description: Detects DLL's Loaded Via Word Containing VBA Macros
level: high
status: experimental
falsepositives:
    - Alerts on legitimate macro usage as well, will need to filter as appropriate
references:
    - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
author: Antonlovesdnb
date: 2020/02/19

logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image:
            - '*\winword.exe'
            - '*\powerpnt.exe'
            - '*\excel.exe'
            - '*\outlook.exe'
        ImageLoaded:
            - '*\VBE7.DLL'
            - '*\VBEUI.DLL'
            - '*\VBE7INTL.DLL'
    condition: selection

id: e6ce8457-68b1-485b-9bdd-3c2b5d679aa9
modified: 2020/08/23
tags:
    - attack.execution
    - attack.t1204 # an old one
    - attack.t1204.002

