title: Unsigned Image Loaded Into LSASS Process
description: Loading unsigned image (DLL, EXE) into LSASS process
level: medium
status: experimental
falsepositives:
    - Valid user connecting using RDP
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
modified: 2020/08/23

logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: '\lsass.exe'
        Signed: 'false'
    condition: selection

id: 857c8db3-c89b-42fb-882b-f681c7cf4da2
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.001

