title: CLR DLL Loaded Via Office Applications
description: Detects CLR DLL being loaded by an Office Product
level: high
status: experimental
falsepositives:
    - Alerts on legitimate macro usage as well, will need to filter as appropriate
references:
    - https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
author: Antonlovesdnb
date: 2020/02/19

logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image:
            - '*\winword.exe'
            - '*\powerpnt.exe'
            - '*\excel.exe'
            - '*\outlook.exe'
        ImageLoaded:
            - '*\clr.dll*'
    condition: selection

id: d13c43f0-f66b-4279-8b2c-5912077c1780
modified: 2020/08/23
tags:
    - attack.execution
    - attack.t1204 # an old one
    - attack.t1204.002

