title: Connection Proxy
description: Detects setting proxy
level: low
status: experimental
falsepositives:
    - Legitimate administration activities
references:
    - https://attack.mitre.org/techniques/T1090/
author: Ömer Günal
date: 2020/06/17

logsource:
    product: linux
detection:
    keyword:
        - 'http_proxy=*'
        - 'https_proxy=*'
    condition: keyword

id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
tags:
    - attack.defense_evasion

