title: Remove Immutable File Attribute
description: Detects removing immutable file attribute
level: medium
status: experimental
falsepositives:
    - Administrator interacting with immutable files (for instance backups)
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.002/T1222.002.yaml
author: Jakob Weinzettl, oscd.community
date: 2019/09/23

logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        a0|contains: 'chattr'
        a1|contains: '-i'
    condition: selection

id: a5b977d6-8a81-4475-91b9-49dbfcd941f7
tags:
    - attack.defense_evasion
    - attack.t1222.002

