title: Shellshock Expression
description: Detects shellshock expressions in log files
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - http://rubular.com/r/zxBfjWfFYs
author: Florian Roth
date: 2017/03/14

logsource:
    product: linux
detection:
    expression:
        - /\(\)\s*\t*\{.*;\s*\}\s*;/
    condition: expression

id: c67e0c98-4d39-46ee-8f6b-437ebf6b950e

