title: File or Folder Permissions Change
description: Detects file and folder permission changes
level: low
status: experimental
falsepositives:
    - User interracting with files permissions (normal/daily behaviour)
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.002/T1222.002.yaml
author: Jakob Weinzettl, oscd.community
date: 2019/09/23

logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        a0|contains:
            - 'chmod'
            - 'chown'
    condition: selection

id: 74c01ace-0152-4094-8ae2-6fd776dd43e5
tags:
    - attack.defense_evasion
    - attack.t1222.002

