title: Space After Filename
description: Detects space after filename
level: low
status: experimental
falsepositives:
    - Typos
references:
    - https://attack.mitre.org/techniques/T1064
author: Ömer Günal
date: 2020/06/17

logsource:
    product: linux
detection:
    selection1:
        - 'echo "*" > * && chmod +x *'
    selection2:
        - 'mv * "* "'
    condition: selection1 and selection2

id: 879c3015-c88b-4782-93d7-07adf92dbcb7
tags:
    - attack.execution

