title: Suspicious Log Entries
description: Detects suspicious log entries in Linux log files
level: medium
status: experimental
falsepositives:
    - Unknown
author: Florian Roth
date: 2017/03/25

logsource:
    product: linux
detection:
    keywords:
        - entered promiscuous mode
        - Deactivating service
        - Oversized packet received from
        - imuxsock begins to drop messages
    condition: keywords

id: f64b6e9a-5d9d-48a5-8289-e1dd2b3876e1

