title: Relevant ClamAV Message
description: Detects relevant ClamAV messages
level: high
status: stable
falsepositives:
    - Unknown
references:
    - https://github.com/ossec/ossec-hids/blob/master/etc/rules/clam_av_rules.xml
author: Florian Roth
date: 2017/03/01

logsource:
    product: linux
    service: clamav
detection:
    keywords:
        - 'Trojan*FOUND'
        - 'VirTool*FOUND'
        - 'Webshell*FOUND'
        - 'Rootkit*FOUND'
        - 'Htran*FOUND'
    condition: keywords

id: 36aa86ca-fd9d-4456-814e-d3b1b8e1e0bb

