title: Disabling Security Tools
id: e3a8a052-111f-4606-9aee-f28ebeb76776
description: Detects disabling security tools

author: Ömer Günal
date: 2020/06/17
logsource:
    product: linux
detection:
    keywords:
        - Command|contains:
            - 'service iptables stop'
            - 'chkconfig off iptables'
            - 'service ip6tables stop'
            - 'chkconfig off ip6tables'
        - CarbonBlack|contains:
            - 'service cbdaemon stop'
            - 'chkconfig off cbdaemon'
            - 'systemctl stop cbdaemon'
            - 'systemctl disable cbdaemon'
        - SELinux:
            - 'setenforce 0'
        - Crowdstrike|contains:
            - 'systemctl stop falcon-sensor.service'
            - 'systemctl disable falcon-sensor.service'
    condition: keywords

references:
    - https://attack.mitre.org/techniques/T1089/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1089/T1089.md
tags:
    - attack.defense_evasion
level: medium
status: experimental
falsepositives:
    - Legitimate administration activities

