title: Password Dumper Remote Thread in LSASS
description: Detects password dumper activity by monitoring remote thread creation EventID 8 in combination with the lsass.exe process as TargetImage. The process in field Process is the malicious program. A single execution can lead to hundreds of events.
level: high
status: stable
falsepositives:
    - unknown
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
author: Thomas Patzke
date: 2017/02/19

logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 8
        TargetImage: 'C:\Windows\System32\lsass.exe'
        StartModule: ''
    condition: selection

id: f239b326-2f41-4d6b-9dfa-c846a60ef505
tags:
    - attack.credential_access
    - attack.s0005
    - attack.t1003 # an old one
    - attack.t1003.001

