title: Suspicious Scripting in a WMI Consumer
description: Detects suspicious scripting in WMI Event Consumers
level: high
status: experimental
falsepositives:
    - Administrative scripts
references:
    - https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
    - https://github.com/Neo23x0/signature-base/blob/master/yara/gen_susp_lnk_files.yar#L19
author: Florian Roth
date: 2019/04/15

logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 20
        Destination:
            - '*new-object system.net.webclient).downloadstring(*'
            - '*new-object system.net.webclient).downloadfile(*'
            - '*new-object net.webclient).downloadstring(*'
            - '*new-object net.webclient).downloadfile(*'
            - '* iex(*'
            - '*WScript.shell*'
            - '* -nop *'
            - '* -noprofile *'
            - '* -decode *'
            - '* -enc *'
    condition: selection

id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1086 # an old one

