title: PowerShell Rundll32 Remote Thread Creation
description: Detects PowerShell remote thread creation in Rundll32.exe
level: high
status: experimental
falsepositives:
    - Unkown
references:
    - https://www.fireeye.com/blog/threat-research/2018/06/bring-your-own-land-novel-red-teaming-technique.html
author: Florian Roth
date: 2018/06/25

logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 8
        SourceImage: '*\powershell.exe'
        TargetImage: '*\rundll32.exe'
    condition: selection

id: 99b97608-3e21-4bfe-8217-2a127c396a0e
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059.001
    - attack.t1085 # an old one
    - attack.t1086 # an old one
    - attack.t1218.011

