title: CobaltStrike Process Injection
description: Detects a possible remote threat creation with certain characteristics which are typical for Cobalt Strike beacons
level: high
status: experimental
falsepositives:
    - unknown
references:
    - https://medium.com/@olafhartong/cobalt-strike-remote-threads-detection-206372d11d0f
    - https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/
author: Olaf Hartong, Florian Roth, Aleksey Potapov, oscd.community
date: 2018/11/30

logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 8
        TargetProcessAddress|endswith:
            - '0B80'
            - '0C7C'
            - '0C88'
    condition: selection

id: 6309645e-122d-4c5b-bb2b-22e4f9c2fa42
modified: 2020/08/28
tags:
    - attack.defense_evasion
    - attack.t1055 # an old one
    - attack.t1055.001

