title: WMI Event Subscription
description: Detects creation of WMI event subscription persistence method
level: high
status: experimental
falsepositives:
    - exclude legitimate (vetted) use of WMI event subscription in your network
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12

logsource:
    product: windows
    service: sysmon
detection:
    selector:
        EventID:
            - 19
            - 20
            - 21
    condition: selector

id: 0f06a3a5-6a09-413f-8743-e6cf35561297
tags:
    - attack.persistence
    - attack.t1084 # an old one
    - attack.t1546.003

