title: Creation Of An User Account
description: Detects the creation of a new user account. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system.
level: medium
status: experimental
falsepositives:
    - Admin activity
references:
    - 'MITRE Attack technique T1136; Create Account '
author: Marie Euler
date: 2020/05/18

logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'SYSCALL'
        exe: '*/useradd'
    condition: selection

id: 759d0d51-bc99-4b5e-9add-8f5b2c8e7512
tags:
    - attack.persistence
    - attack.t1136 # an old one
    - attack.t1136.001

