title: Security Eventlog Cleared
description: Some threat groups tend to delete the local 'Security' Eventlog using certain utitlities
level: high
falsepositives:
    - Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)
    - System provisioning (system reset before the golden image creation)
author: Florian Roth
date: 2017/02/19

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 517
            - 1102
    condition: selection

id: f2f01843-e7b8-4f95-a35a-d23584476423
modified: 2020/08/23
tags:
    - attack.defense_evasion
    - attack.t1070 # an old one
    - attack.t1070.001
    - car.2016-04-002

