title: User Added to Local Administrators
description: This rule triggers on user accounts that are added to the local Administrators group, which could be legitimate activity or a sign of privilege escalation activity
level: medium
status: stable
falsepositives:
    - Legitimate administrative activity
author: Florian Roth
date: 2017/03/14

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4732
    selection_group1:
        GroupName: 'Administrators'
    selection_group2:
        GroupSid: 'S-1-5-32-544'
    filter:
        SubjectUserName: '*$'
    condition: selection and (1 of selection_group*) and not filter

id: c265cf08-3f99-46c1-8d59-328247057d57
modified: 2020/08/23
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1078
    - attack.t1098

