title: Smbexec.py Service Installation
description: Detects the use of smbexec.py tool by detecting a specific service installation
level: critical
falsepositives:
    - Penetration Test
    - Unknown
references:
    - https://blog.ropnop.com/using-credentials-to-own-windows-boxes-part-2-psexec-and-services/
author: Omer Faruk Celik
date: 2018/03/20
modified: 2020/08/23

logsource:
    product: windows
    service: system
detection:
    service_installation:
        EventID: 7045
        ServiceName: 'BTOBTO'
        ServiceFileName: '*\execute.bat'
    condition: service_installation

id: 52a85084-6989-40c3-8f32-091e12e13f09
fields:
    - ServiceName
    - ServiceFileName
tags:
    - attack.execution
    - attack.lateral_movement
    - attack.t1021.002
    - attack.t1035 # an old one
    - attack.t1077 # an old one
    - attack.t1569.002

