title: MMC20 Lateral Movement
description: Detects MMC20.Application Lateral Movement; specifically looks for the spawning of the parent MMC.exe with a command line of "-Embedding" as a child of svchost.exe
level: high
falsepositives:
    - Unlikely
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view?usp=sharing
author: '@2xxeformyshirt (Security Risk Advisors) - rule; Teymur Kheirkhabarov (idea)'
date: 2020/03/04
modified: 2020/08/23

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\svchost.exe'
        Image: '*\mmc.exe'
        CommandLine: '*-Embedding*'
    condition: selection

id: f1f3bf22-deb2-418d-8cce-e1a45e46a5bd
tags:
    - attack.execution
    - attack.t1021.003
    - attack.t1175 # an old one

