title: USB Device Plugged
description: Detects plugged USB devices
level: low
status: experimental
falsepositives:
    - Legitimate administrative activity
references:
    - https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/
    - https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/
author: Florian Roth
date: 2017/11/09

logsource:
    product: windows
    service: driver-framework
detection:
    selection:
        EventID:
            - 2003 # Loading drivers
            - 2100 # Pnp or power management
            - 2102 # Pnp or power management
    condition: selection

id: 1a4bd6e3-4c6e-405d-a9a3-53a116e341d4
tags:
    - attack.initial_access
    - attack.t1200

