title: LSASS Access from Non System Account
description: Detects potential mimikatz-like tools accessing LSASS from non system account
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/06_credential_access/T1003_credential_dumping/lsass_access_non_system_account.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/06/20
modified: 2019/11/10

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4663
            - 4656
        ObjectType: 'Process'
        ObjectName|endswith: '\lsass.exe'
    filter:
        SubjectUserName|endswith: '$'
    condition: selection and not filter

id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
fields:
    - ComputerName
    - ObjectName
    - SubjectUserName
    - ProcessName
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.001

