title: Secure Deletion with SDelete
description: Detects renaming of file while deletion with SDelete tool
level: medium
status: experimental
falsepositives:
    - Legitime usage of SDelete
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://technet.microsoft.com/en-us/en-en/sysinternals/sdelete.aspx
author: Thomas Patzke
date: 2017/06/14
modified: 2020/08/2

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4656
            - 4663
            - 4658
        ObjectName:
            - '*.AAA'
            - '*.ZZZ'
    condition: selection

id: 39a80702-d7ca-4a83-b776-525b1f86a36d
tags:
    - attack.defense_evasion
    - attack.impact
    - attack.s0195
    - attack.t1027.005
    - attack.t1066 # an old one
    - attack.t1070.004
    - attack.t1107 # an old one
    - attack.t1485
    - attack.t1553.002

