title: External Disk Drive or USB Storage Device
description: Detects external diskdrives or plugged in USB devices
level: low
status: experimental
falsepositives:
    - Legitimate administrative activity
author: Keith Wright
date: 2019/11/20

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 6416
        DeviceClassName: 'DiskDrive'
    selection2:
        DeviceDescription: 'USB Mass Storage Device'
    condition: selection or selection2

id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
tags:
    - attack.initial_access
    - attack.lateral_movement
    - attack.t1091
    - attack.t1200

