title: SAM Registry Hive Handle Request
description: Detects handles requested to SAM registry hive
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/07_discovery/T1012_query_registry/sam_registry_hive_access.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/12
modified: 2020/08/23

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4656
        ObjectType: 'Key'
        ObjectName|endswith: '\SAM'
    condition: selection

id: f8748f2c-89dc-4d95-afb0-5a2dfdbad332
fields:
    - ComputerName
    - SubjectDomainName
    - SubjectUserName
    - ProcessName
    - ObjectName
tags:
    - attack.credential_access
    - attack.discovery
    - attack.t1012
    - attack.t1552.002

