title: Suspicious Windows ANONYMOUS LOGON Local Account Created
description: Detects the creation of suspicious accounts simliar to ANONYMOUS LOGON, such as using additional spaces. Created as an covering detection for exclusion of Logon Type 3 from ANONYMOUS LOGON accounts.
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/SBousseaden/status/1189469425482829824
author: James Pemberton / @4A616D6573
date: 2019/10/31

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4720
        SAMAccountName: '*ANONYMOUS*LOGON*'
    condition: selection

id: 1bbf25b9-8038-4154-a50b-118f2a32be27
modified: 2020/08/23
tags:
    - attack.persistence
    - attack.t1136 # an old one
    - attack.t1136.001
    - attack.t1136.002

