title: Remote Registry Management Using Reg Utility
description: Remote registry management using REG utility from non-admin workstation
level: medium
status: experimental
falsepositives:
    - Legitimate usage of remote registry management by administrator
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
modified: 2020/08/23

logsource:
    product: windows
    service: security
detection:
    selection_1:
        EventID: 5145
        RelativeTargetName|contains: '\winreg'
    selection_2:
        IpAddress: '%Admins_Workstations%'
    condition: selection_1 and not selection_2

id: 68fcba0d-73a5-475e-a915-e8b4c576827e
tags:
    - attack.credential_access
    - attack.defense_evasion
    - attack.discovery
    - attack.s0075
    - attack.t1012
    - attack.t1112
    - attack.t1552.002

