title: Addition of Domain Trusts
id: 0255a820-e564-4e40-af2b-6ac61160335c
description: Addition of domains is seldom and should be verified for legitimacy.
author: Thomas Patzke
date: 2019/12/03

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4706
    condition: selection

tags:
    - attack.persistence
level: medium
status: stable
falsepositives:
    - Legitimate extension of domain structure

