title: Turla Service Install
description: This method detects a service install of malicious services mentioned in Carbon Paper - Turla report by ESET
level: high
falsepositives:
    - Unknown
references:
    - https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/
author: Florian Roth
date: 2017/03/31

logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
        ServiceName:
            - 'srservice'
            - 'ipvpn'
            - 'hkmsvc'
    condition: selection

id: 1df8b3da-b0ac-4d8a-b7c7-6cb7c24160e4
tags:
    - attack.g0010
    - attack.persistence
    - attack.t1050 # an old one
    - attack.t1543.003

