title: QuarksPwDump Clearing Access History
description: Detects QuarksPwDump clearing access history in hive
level: critical
status: experimental
falsepositives:
    - Unknown
author: Florian Roth
date: 2017/05/15

logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 16
        HiveName|contains: '\AppData\Local\Temp\SAM'
        HiveName|endswith: '.dmp'
    condition: selection

id: 39f919f3-980b-4e6f-a975-8af7e507ef2b
modified: 2019/11/13
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.002

