title: SCM Database Privileged Operation
description: Detects non-system users performing privileged operation os the SCM database
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/07_discovery/T1000_local_admin_check/local_admin_remote_check_openscmanager.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/15

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4674
        ObjectType: 'SC_MANAGER OBJECT'
        ObjectName: 'servicesactive'
        PrivilegeList: 'SeTakeOwnershipPrivilege'
        SubjectLogonId: "0x3e4"
    condition: selection

id: dae8171c-5ec6-4396-b210-8466585b53e9

