title: Suspicious Kerberos RC4 Ticket Encryption
description: Detects service ticket requests using RC4 encryption type
level: medium
status: experimental
falsepositives:
    - Service accounts used on legacy systems (e.g. NetApp)
    - Windows Domains with DFL 2003 and legacy systems
references:
    - https://adsecurity.org/?p=3458
    - https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity
author: Florian Roth
date: 2017/02/06

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4769
        TicketOptions: '0x40810000'
        TicketEncryptionType: '0x17'
    reduction:
        - ServiceName: '$*'
    condition: selection and not reduction

id: 496a0e47-0a33-4dca-b009-9e6ca3591f39
tags:
    - attack.credential_access
    - attack.t1208 # an old one
    - attack.t1558.003

