title: Potential Remote Desktop Connection to Non-Domain Host
description: Detects logons using NTLM to hosts that are potentially not part of the domain.
level: medium
status: experimental
falsepositives:
    - Host connections to valid domains, exclude these.
    - Host connections not using host FQDN.
    - Host connections to external legitimate domains.
references:
    - n/a
author: James Pemberton
date: 2020/05/22

logsource:
    product: windows
    service: ntlm
    definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
    selection:
        EventID: 8001
        TargetName: TERMSRV*
    condition: selection

id: ce5678bb-b9aa-4fb5-be4b-e57f686256ad
fields:
    - Computer
    - UserName
    - DomainName
    - TargetName
tags:
    - attack.command_and_control
    - attack.t1219

