title: DPAPI Domain Backup Key Extraction
description: Detects tools extracting LSA secret DPAPI domain backup key from Domain Controllers
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/06_credential_access/T1003_credential_dumping/domain_dpapi_backupkey_extraction.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/06/20

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4662
        ObjectType: 'SecretObject'
        AccessMask: '0x2'
        ObjectName: 'BCKUPKEY'
    condition: selection

id: 4ac1f50b-3bd0-4968-902d-868b4647937e
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.004

