title: New or Renamed User Account with '$' in Attribute 'SamAccountName'.
description: Detects possible bypass EDR and SIEM via abnormal user account name.
level: high
status: experimental
falsepositives:
    - Unkown
author: Ilyas Ochkov, oscd.community
date: 2019/10/25

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4720 # create user
            - 4781 # rename user
        UserName|contains: '$' #SamAccountName
    condition: selection

id: cfeed607-6aa4-4bbd-9627-b637deb723c8
modified: 2019/11/13
fields:
    - EventID
    - UserName
    - SubjectAccountName
tags:
    - attack.defense_evasion
    - attack.t1036

