title: RottenPotato Like Attack Pattern
description: Detects logon events that have characteristics of events generated during an attack with RottenPotato and the like
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/SBousseaden/status/1195284233729777665
author: "@SBousseaden, Florian Roth"
date: 2019/11/15

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 3
        TargetUserName: 'ANONYMOUS_LOGON'
        WorkstationName: '-'
        SourceNetworkAddress: '127.0.0.1'
    condition: selection

id: 16f5d8ca-44bd-47c8-acbe-6fc95a16c12f
tags:
    - attack.credential_access
    - attack.privilege_escalation
    - attack.t1171 # an old one
    - attack.t1557.001

