title: Access to ADMIN$ Share
id: 098d7118-55bc-4912-a836-dc6483a8d150
description: Detects access to $ADMIN share
logsource:
    product: windows
    service: security
    definition: 'The advanced audit policy setting "Object Access > Audit File Share" must be configured for Success/Failure'
detection:
    selection:
        EventID: 5140
        ShareName: Admin$
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
tags:
    - attack.lateral_movement
    - attack.t1021.002
    - attack.t1077 # an old one
author: Florian Roth
date: 2017/03/04
modified: 2020/08/23
level: low
status: experimental
falsepositives:
    - Legitimate administrative activity

