title: DHCP Server Loaded the CallOut DLL
description: This rule detects a DHCP server in which a specified Callout DLL (in registry) was loaded
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
    - https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
    - https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
author: Dimitrios Slamaris
date: 2017/05/15

logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 1033
        Source: Microsoft-Windows-DHCP-Server
    condition: selection

id: 13fc89a9-971e-4ca6-b9dc-aa53a445bf40
tags:
    - attack.defense_evasion
    - attack.t1073 # an old one
    - attack.t1574.002

