title: WCE wceaux.dll Access
description: Detects wceaux.dll access while WCE pass-the-hash remote command execution on source host
level: critical
status: experimental
falsepositives:
    - Penetration testing
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
author: Thomas Patzke
date: 2017/06/14

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4656
            - 4658
            - 4660
            - 4663
        ObjectName: '*\wceaux.dll'
    condition: selection

id: 1de68c67-af5c-4097-9c85-fe5578e09e67
tags:
    - attack.credential_access
    - attack.s0005
    - attack.t1003

