title: Failed Code Integrity Checks
description: Code integrity failures may indicate tampered executables.
level: low
status: stable
falsepositives:
    - Disk device errors
author: Thomas Patzke
date: 2019/12/03

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 5038
            - 6281
    condition: selection

id: 470ec5fa-7b4e-4071-b200-4c753100f49b
modified: 2020/08/23
tags:
    - attack.defense_evasion
    - attack.t1009 # an old one
    - attack.t1027.001

