title: Interactive Logon to Server Systems
description: Detects interactive console logons to Server Systems
level: medium
falsepositives:
    - Administrative activity via KVM or ILO board
author: Florian Roth
date: 2017/03/17

logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 528
            - 529
            - 4624
            - 4625
        LogonType: 2
        ComputerName:
            - '%ServerSystems%'
            - '%DomainControllers%'
    filter:
        LogonProcessName: Advapi
        ComputerName: '%Workstations%'
    condition: selection and not filter

id: 3ff152b2-1388-4984-9cd9-a323323fdadf
tags:
    - attack.lateral_movement
    - attack.t1078

