title: RedMimicry Winnti Playbook Dropped File
description: Detects actions caused by the RedMimicry Winnti playbook
level: high
falsepositives:
    - Unknown
references:
    - https://redmimicry.com
author: Alexander Rausch
date: 2020/06/24

logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|contains:
            - gthread-3.6.dll
            - sigcmm-2.4.dll
            - \Windows\Temp\tmp.bat
    condition: selection

id: 130c9e58-28ac-4f83-8574-0a4cc913b97e
tags:
    - attack.defense_evasion
    - attack.t1027

