title: Hijack Legit RDP Session to Move Laterally
description: Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder
level: high
status: experimental
falsepositives:
    - unknown
author: Samir Bousseaden
date: 2019/02/21

logsource:
    product: windows
    category: file_event
detection:
    selection:
        Image: '*\mstsc.exe'
        TargetFilename: '*\Microsoft\Windows\Start Menu\Programs\Startup\\*'
    condition: selection

id: 52753ea4-b3a0-4365-910d-36cff487b789

