title: MsiExec Web Install
description: Detects suspicious msiexec process starts with web addreses as parameter
level: medium
status: experimental
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
references:
    - https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
author: Florian Roth
date: 2018/02/09

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '* msiexec*://*'
    condition: selection

id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
modified: 2020/08/30
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1105
    - attack.t1218.007

