title: Suspicious Use of Procdump
description: Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process. This way we're also able to catch cases in which the attacker has renamed the procdump executable.
level: high
status: experimental
falsepositives:
    - Unlikely, because no one should dump an lsass process memory
    - Another tool that uses the command line switches of Procdump
references:
    - Internal Research
author: Florian Roth
date: 2018/10/30

logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine:
            - '* -ma *'
    selection2:
        CommandLine:
            - '* lsass*'
    selection3:
        CommandLine:
            - '* -ma ls*'
    condition: ( selection1 and selection2 ) or selection3

id: 5afee48e-67dd-4e03-a783-f74259dcf998
modified: 2019/10/14
tags:
    - attack.credential_access
    - attack.defense_evasion
    - attack.t1003 # an old one     
    - attack.t1003.001
    - attack.t1036
    - car.2013-05-009

