title: MMC Spawning Windows Shell
description: Detects a Windows command line executable started from MMC
level: high
status: experimental
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
author: Karneades, Swisscom CSIRT
date: 2019/08/05
modified: 2020/09/01

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\mmc.exe'
        Image:
            - '*\cmd.exe'
            - '*\powershell.exe'
            - '*\wscript.exe'
            - '*\cscript.exe'
            - '*\sh.exe'
            - '*\bash.exe'
            - '*\reg.exe'
            - '*\regsvr32.exe'
            - '*\BITSADMIN*'
    condition: selection

id: 05a2ab7e-ce11-4b63-86db-ab32e763e11d
fields:
    - CommandLine
    - Image
    - ParentCommandLine
tags:
    - attack.lateral_movement
    - attack.t1021.003
    - attack.t1175 # an old one

