title: Taskmgr as Parent
description: Detects the creation of a process from Windows task manager
level: low
status: experimental
falsepositives:
    - Administrative activity
author: Florian Roth
date: 2018/03/13

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\taskmgr.exe'
    filter:
        Image:
            - '*\resmon.exe'
            - '*\mmc.exe'
            - '*\taskmgr.exe'
    condition: selection and not filter

id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
fields:
    - Image
    - CommandLine
    - ParentCommandLine
tags:
    - attack.defense_evasion
    - attack.t1036

