title: Suspicious Curl File Upload
description: Detects a suspicious curl process start the adds a file to a web request
level: medium
status: experimental
falsepositives:
    - Scripts created by developers and admins
references:
    - https://twitter.com/d1r4c/status/1279042657508081664
    - https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76
author: Florian Roth
date: 2020/07/03
modified: 2020/09/05

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\curl.exe'
        CommandLine|contains: ' -F '
    condition: selection

id: 00bca14a-df4e-4649-9054-3f2aa676bc04
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.exfiltration
    - attack.t1567

