title: PowerShell Encoded Character Syntax
id: e312efd0-35a1-407f-8439-b8d434b438a6
description: Detects suspicious encoded character syntax often used for defense evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: '(WCHAR)0x'
    condition: selection
references:
    - https://twitter.com/0gtweet/status/1281103918693482496
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1027
    - attack.t1059.001
    - attack.t1086 # an old one
author: Florian Roth
date: 2020/07/09
level: high
status: experimental
falsepositives:
    - Unknown

