title: Windows 10 Scheduled Task SandboxEscaper 0-day
description: Detects Task Scheduler .job import arbitrary DACL write\par
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe
author: Olaf Hartong
date: 2019/05/22
modified: 2020/08/29

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine: '*/change*/TN*/RU*/RP*'
    condition: selection

id: 931b6802-d6a6-4267-9ffa-526f57f22aaf
tags:
    - attack.privilege_escalation
    - attack.t1053 # an old one
    - attack.t1053.005
    - car.2013-08-001

