title: CrackMapExecWin
description: Detects CrackMapExecWin Activity as Described by NCSC
level: critical
status: experimental
falsepositives:
    - None
references:
    - https://www.ncsc.gov.uk/alerts/hostile-state-actors-compromising-uk-organisations-focus-engineering-and-industrial-control
author: Markus Neis
date: 2018/04/08

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\crackmapexec.exe'
    condition: selection

id: 04d9079e-3905-4b70-ad37-6bdf11304965
tags:
    - attack.g0035

