title: Suspicious RDP Redirect Using TSCON
description: Detects a suspicious RDP session redirect using tscon.exe
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html
    - https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
author: Florian Roth
date: 2018/03/17

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '* /dest:rdp-tcp:*'
    condition: selection

id: f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb
modified: 2020/08/29
tags:
    - attack.lateral_movement
    - attack.t1076 # an old one
    - attack.t1563.002
    - car.2013-07-002

