title: Regsvr32 Flags Anomaly
description: Detects a flag anomaly in which regsvr32.exe uses a /i flag without using a /n flag at the same time
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/sbousseaden/status/1282441816986484737?s=12
author: Florian Roth
date: 2019/07/13

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regsvr32.exe'
        CommandLine|contains: ' /i:'
    filter:
        CommandLine|contains: ' /n '
    condition: selection and not filter

id: b236190c-1c61-41e9-84b3-3fe03f6d76b0
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.defense_evasion
    - attack.t1117 # an old one 
    - attack.t1218.010

