title: Suspicious SYSVOL Domain Group Policy Access
description: Detects Access to Domain Group Policies stored in SYSVOL
level: medium
status: experimental
falsepositives:
    - administrative activity
references:
    - https://adsecurity.org/?p=2288
    - https://www.hybrid-analysis.com/sample/f2943f5e45befa52fb12748ca7171d30096e1d4fc3c365561497c618341299d5?environmentId=100
author: Markus Neis
date: 2018/04/09

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*\SYSVOL\\*\policies\\*'
    condition: selection

id: 05f3c945-dcc8-4393-9f3d-af65077a8f86
modified: 2020/08/28
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1552.006

