title: SquiblyTwo
description: Detects WMI SquiblyTwo Attack with possible renamed WMI by looking for imphash
level: medium
status: experimental
falsepositives:
    - Unknown
references:
    - https://subt0x11.blogspot.ch/2018/04/wmicexe-whitelisting-bypass-hacking.html
    - https://twitter.com/mattifestation/status/986280382042595328
author: Markus Neis / Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image:
            - '*\wmic.exe'
        CommandLine:
            - wmic * *format:\"http*
            - wmic * /format:'http
            - wmic * /format:http*
    selection2:
        Imphash:
            - 1B1A3F43BF37B5BFE60751F2EE2F326E
            - 37777A96245A3C74EB217308F3546F4C
            - 9D87C9D67CE724033C0B40CC4CA1B206
        CommandLine:
            - '* *format:\"http*'
            - '* /format:''http'
            - '* /format:http*'
    condition: 1 of them

id: 8d63dadf-b91b-4187-87b6-34a1114577ea
modified: 2020/08/27
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1047
    - attack.t1059 # an old one
    - attack.t1059.005
    - attack.t1059.007
    - attack.t1220

