title: Suspicious Debugger Registration Cmdline
description: Detects the registration of a debugger for a program that is available in the logon screen (sticky key backdoor).
level: high
status: experimental
falsepositives:
    - Penetration Tests
references:
    - https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
author: Florian Roth
date: 2019/09/06

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\CurrentVersion\Image File Execution Options\sethc.exe*'
            - '*\CurrentVersion\Image File Execution Options\utilman.exe*'
            - '*\CurrentVersion\Image File Execution Options\osk.exe*'
            - '*\CurrentVersion\Image File Execution Options\magnify.exe*'
            - '*\CurrentVersion\Image File Execution Options\narrator.exe*'
            - '*\CurrentVersion\Image File Execution Options\displayswitch.exe*'
            - '*\CurrentVersion\Image File Execution Options\atbroker.exe*'
    condition: selection

id: ae215552-081e-44c7-805f-be16f975c8a2
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1015 # an old one
    - attack.t1546.008

