title: Possible Ransomware or Unauthorized MBR Modifications
description: Detects, possibly, malicious unauthorized usage of bcdedit.exe
level: medium
status: experimental
references:
    - https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set
author: '@neu5ron'
date: 2019/02/07

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\bcdedit.exe'
        CommandLine:
            - '*delete*'
            - '*deletevalue*'
            - '*import*'
    condition: selection

id: c9fbe8e9-119d-40a6-9b59-dd58a5d84429
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1067 # an old one
    - attack.t1070
    - attack.t1542.003

