title: Rubeus Hack Tool
description: Detects command line parameters used by Rubeus hack tool
level: critical
falsepositives:
    - unlikely
references:
    - https://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
author: Florian Roth
date: 2018/12/19

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '* asreproast *'
            - '* dump /service:krbtgt *'
            - '* kerberoast *'
            - '* createnetonly /program:*'
            - '* ptt /ticket:*'
            - '* /impersonateuser:*'
            - '* renew /ticket:*'
            - '* asktgt /user:*'
            - '* harvest /interval:*'
    condition: selection

id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
tags:
    - attack.credential_access
    - attack.lateral_movement
    - attack.t1003
    - attack.t1097 # an old one
    - attack.t1550.003
    - attack.t1558 # an old one
    - attack.t1558.003

