title: Execution in Webserver Root Folder
description: Detects a suspicious program execution in a web service root folder (filter out false positives)
level: medium
status: experimental
falsepositives:
    - Various applications
    - Tools that include ping or nslookup command invocations
author: Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\wwwroot\\*'
            - '*\wmpub\\*'
            - '*\htdocs\\*'
    filter:
        Image:
            - '*bin\\*'
            - '*\Tools\\*'
            - '*\SMSComponent\\*'
        ParentImage:
            - '*\services.exe'
    condition: selection and not filter

id: 35efb964-e6a5-47ad-bbcd-19661854018d
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.persistence
    - attack.t1100 # an old one
    - attack.t1505.003

