title: Run Whoami as SYSTEM
description: Detects a whoami.exe executed by LOCAL SYSTEM. This may be a sign of a successful local privilege escalation.
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
author: Teymur Kheirkhabarov
date: 2019/10/23

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        User: 'NT AUTHORITY\SYSTEM'
        Image|endswith: '\whoami.exe'
    condition: selection

id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
modified: 2019/11/11
tags:
    - attack.discovery
    - attack.privilege_escalation
    - attack.t1033

