title: Interactive AT Job
description: Detect an interactive AT job, which may be used as a form of privilege escalation
level: high
status: experimental
falsepositives:
    - Unlikely (at.exe deprecated as of Windows 8)
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053/T1053.yaml
    - https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame), oscd.community
date: 2019/10/24

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\at.exe'
        CommandLine|contains: 'interactive'
    condition: selection

id: 60fc936d-2eb0-4543-8a13-911c750a1dfc
modified: 2019/11/11
fields:
    - ComputerName
    - User
    - CommandLine
tags:
    - attack.privilege_escalation
    - attack.t1053 # an old one
    - attack.t1053.002

