title: Suspicious Bitsadmin Job via PowerShell
description: Detect download by BITS jobs via PowerShell
level: medium
status: experimental
falsepositives:
    - Unknown
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/ec5180c9-721a-460f-bddc-27539a284273.html
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md
author: Endgame, JHasenbusch (ported to sigma for oscd.community)
date: 2018/10/30

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains: 'Start-BitsTransfer'
    condition: selection

id: f67dbfce-93bc-440d-86ad-a95ae8858c90
modified: 2019/11/11
fields:
    - ComputerName
    - User
    - CommandLine
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1197

