title: Netsh RDP Port Forwarding
description: Detects netsh commands that configure a port forwarding of port 3389 used for RDP
level: high
status: experimental
falsepositives:
    - Legitimate administration
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
author: Florian Roth
date: 2019/01/29

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - netsh i* p*=3389 c*
    condition: selection

id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.lateral_movement
    - attack.t1090

