title: IIS Native-Code Module Command Line Installation
description: Detects suspicious IIS native-code module installations via command line
level: medium
status: experimental
falsepositives:
    - Unknown as it may vary from organisation to arganisation how admins use to install IIS modules
references:
    - https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
author: Florian Roth
date: 2012/12/11

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\APPCMD.EXE install module /name:*'
    condition: selection

id: 9465ddf4-f9e4-4ebd-8d98-702df3a93239
tags:
    - attack.persistence
    - attack.t1100 # an old one
    - attack.t1505.003

