title: Sysprep on AppData Folder
description: Detects suspicious sysprep process start with AppData folder as target (as used by Trojan Syndicasec in Thrip report by Symantec)
level: medium
status: experimental
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
references:
    - https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets
    - https://app.any.run/tasks/61a296bb-81ad-4fee-955f-3b399f4aaf4b
author: Florian Roth
date: 2018/06/22

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\sysprep.exe *\AppData\\*'
            - sysprep.exe *\AppData\\*
    condition: selection

id: d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e
modified: 2018/12/11
tags:
    - attack.execution

