title: Scheduled Task Creation
description: Detects the creation of scheduled tasks in user session
level: low
status: experimental
falsepositives:
    - Administrative activity
    - Software installation
author: Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\schtasks.exe'
        CommandLine: '* /create *'
    filter:
        User: NT AUTHORITY\SYSTEM
    condition: selection and not filter

id: 92626ddd-662c-49e3-ac59-f6535f12d189
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege_escalation
    - attack.s0111
    - attack.t1053 # an old one 
    - attack.t1053.005
    - car.2013-08-001

