title: XSL Script Processing
description: Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files, rule detects when adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses
level: medium
status: experimental
falsepositives:
    - WMIC.exe FP depend on scripts and administrative methods used in the monitored environment
    - msxsl.exe is not installed by default so unlikely.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1220/T1220.yaml
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
modified: 2019/11/04

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\wmic.exe'
          CommandLine|contains: '/format' # wmic process list /FORMAT /?
        - Image|endswith: '\msxsl.exe'
    condition: selection

id: 05c36dd6-79d6-4a9a-97da-3db20298ab2d
tags:
    - attack.defense_evasion
    - attack.execution # an old one
    - attack.t1220

