title: Elise Backdoor
description: Detects Elise backdoor acitivty as used by APT32
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://community.rsa.com/community/products/netwitness/blog/2018/02/13/lotus-blossom-continues-asean-targeting
author: Florian Roth
date: 2018/01/31

logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image: 'C:\Windows\SysWOW64\cmd.exe'
        CommandLine: '*\Windows\Caches\NavShExt.dll *'
    selection2:
        CommandLine: '*\AppData\Roaming\MICROS~1\Windows\Caches\NavShExt.dll,Setting'
    condition: 1 of them

id: e507feb7-5f73-4ef6-a970-91bb6f6d744f
modified: 2020/08/26
tags:
    - attack.execution
    - attack.g0030
    - attack.g0050
    - attack.s0081
    - attack.t1059 # an old one
    - attack.t1059.003

