title: Domain Trust Discovery
description: Detects a discovery of domain trusts
level: medium
status: experimental
falsepositives:
    - Administration of systems
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.yaml
author: Jakob Weinzettl, oscd.community
date: 2019/10/23

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\dsquery.exe'
          CommandLine|contains|all:
            - '-filter'
            - 'trustedDomain'
        - Image|endswith: '\nltest.exe'
          CommandLine|contains: 'domain_trusts'
    condition: selection

id: 77815820-246c-47b8-9741-e0def3f57308
modified: 2019/11/08
tags:
    - attack.discovery
    - attack.t1482

