title: Suspicious Reconnaissance Activity
description: Detects suspicious command line activity on Windows systems
level: medium
status: experimental
falsepositives:
    - Inventory tool runs
    - Penetration tests
    - Administrative activity
author: Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - net group "domain admins" /domain
            - net localgroup administrators
    condition: selection

id: d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
modified: 2020/08/28
fields:
    - CommandLine
    - ParentCommandLine
analysis:
    recommendation: Check if the user that executed the commands is suspicious (e.g. service accounts, LOCAL_SYSTEM)
tags:
    - attack.discovery
    - attack.t1087 # an old one 
    - attack.t1087.001
    - attack.t1087.002

