title: Renamed PowerShell
description: Detects the execution of a renamed PowerShell often used by attackers or malware
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/christophetd/status/1164506034720952320
author: Florian Roth
date: 2019/08/22

logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Description: 'Windows PowerShell'
        Company: 'Microsoft Corporation'
    filter:
        Image:
            - '*\powershell.exe'
            - '*\powershell_ise.exe'
    condition: selection and not filter

id: d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20
modified: 2020/09/06
tags:
    - attack.defense_evasion
    - attack.t1036 # an old one
    - attack.t1036.003
    - car.2013-05-009

