title: PowerShell Download from URL
description: Detects a Powershell process that contains download commands in its command line string
level: medium
status: experimental
falsepositives:
    - unknown
author: Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\powershell.exe'
        CommandLine:
            - '*new-object system.net.webclient).downloadstring(*'
            - '*new-object system.net.webclient).downloadfile(*'
            - '*new-object net.webclient).downloadstring(*'
            - '*new-object net.webclient).downloadfile(*'
    condition: selection

id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one

