title: Detection of PowerShell Execution via DLL
description: Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/p3nt4/PowerShdll/blob/master/README.md
author: Markus Neis
date: 2018/08/25

logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image:
            - '*\rundll32.exe'
    selection2:
        Description:
            - '*Windows-Hostprozess (Rundll32)*'
    selection3:
        CommandLine:
            - '*Default.GetString*'
            - '*FromBase64String*'
    condition: (selection1 or selection2) and selection3

id: 6812a10b-60ea-420c-832f-dfcc33b646ba
modified: 2020/09/01
tags:
    - attack.defense_evasion
    - attack.t1085 # an old one
    - attack.t1218.011

