title: Baby Shark Activity
description: Detects activity that could be related to Baby Shark malware
level: high
status: experimental
falsepositives:
    - unknown
references:
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
author: Florian Roth
date: 2019/02/24

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - reg query "HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default"
            - powershell.exe mshta.exe http*
            - cmd.exe /c taskkill /im cmd.exe
    condition: selection

id: 2b30fa36-3a18-402f-a22d-bf4ce2189f35
modified: 2020/08/26
tags:
    - attack.defense_evasion
    - attack.discovery
    - attack.execution
    - attack.t1012
    - attack.t1059 # an old one
    - attack.t1059.001
    - attack.t1059.003
    - attack.t1086 # an old one
    - attack.t1170 # an old one
    - attack.t1218 # an old one
    - attack.t1218.005

