title: Windows Network Enumeration
description: Identifies attempts to enumerate hosts in a network using the built-in Windows net.exe tool.
level: low
status: stable
falsepositives:
    - Legitimate use of net.exe utility by legitimate user
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1018/T1018.yaml
author: Endgame, JHasenbusch (ported for oscd.community)
date: 2018/10/30

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\net.exe'
            - '\net1.exe'
        CommandLine|contains: 'view'
    filter:
        CommandLine|contains: \\\
    condition: selection and not filter

id: 62510e69-616b-4078-b371-847da438cc03
modified: 2019/11/11
fields:
    - ComputerName
    - User
    - CommandLine
tags:
    - attack.discovery
    - attack.t1018

