title: Cmdkey Cached Credentials Recon
description: Detects usage of cmdkey to look for cached credentials
level: low
status: experimental
falsepositives:
    - Legitimate administrative tasks.
references:
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
author: jmallette
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\cmdkey.exe'
        CommandLine: '* /list *'
    condition: selection

id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
fields:
    - CommandLine
    - ParentCommandLine
    - User
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.005

