title: Suspicious PowerShell Invocation Based on Parent Process
description: Detects suspicious powershell invocations from interpreters or unusual programs
level: medium
status: experimental
falsepositives:
    - Microsoft Operations Manager (MOM)
    - Other scripts
references:
    - https://www.carbonblack.com/2017/03/15/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/
author: Florian Roth
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage:
            - '*\wscript.exe'
            - '*\cscript.exe'
        Image:
            - '*\powershell.exe'
    falsepositive:
        CurrentDirectory: '*\Health Service State\\*'
    condition: selection and not falsepositive

id: 95eadcb2-92e4-4ed1-9031-92547773a6db
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one

