title: Stop Windows Service
description: Detects a windows service to be stopped
level: low
status: experimental
falsepositives:
    - Administrator shutting down the service due to upgrade or removal purposes
author: Jakob Weinzettl, oscd.community
date: 2019/10/23

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith:
            - '\sc.exe'
            - '\net.exe'
            - '\net1.exe'
          CommandLine|contains: 'stop'
    condition: selection

id: eb87818d-db5d-49cc-a987-d5da331fbd90
modified: 2019/11/08
fields:
    - ComputerName
    - User
    - CommandLine
tags:
    - attack.impact
    - attack.t1489

