title: Non Interactive PowerShell
description: Detects non-interactive PowerShell activity by looking at powershell.exe with not explorer.exe as a parent.
level: medium
status: experimental
falsepositives:
    - Legitimate programs executing PowerShell scripts
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/basic_powershell_execution.md
author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
date: 2019/09/12
modified: 2019/11/10

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
    filter:
        ParentImage|endswith: '\explorer.exe'
    condition: selection and not filter

id: f4bbd493-b796-416e-bbf2-121235348529
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one

