title: ZOHO Dctask64 Process Injection
description: Detects suspicious process injection using ZOHO's dctask64.exe
level: high
status: experimental
falsepositives:
    - Unknown yet
references:
    - https://twitter.com/gN3mes1s/status/1222088214581825540
    - https://twitter.com/gN3mes1s/status/1222095963789111296
    - https://twitter.com/gN3mes1s/status/1222095371175911424
author: Florian Roth
date: 2020/01/28

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\dctask64.exe'
    filter:
        CommandLine|contains:
            - 'DesktopCentral_Agent\agent'
    condition: selection and not filter

id: 6345b048-8441-43a7-9bed-541133633d7a
modified: 2020/08/30
fields:
    - CommandLine
    - ParentCommandLine
    - ParentImage
tags:
    - attack.defense_evasion
    - attack.t1055 # an old one
    - attack.t1055.001

