title: Shadow Copies Access via Symlink
description: Shadow Copies storage symbolic link creation using operating systems utilities
level: medium
status: experimental
falsepositives:
    - Legitimate administrator working with shadow copies, access for backup purposes
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - mklink
            - HarddiskVolumeShadowCopy
    condition: selection

id: 40b19fa6-d835-400c-b301-41f3a2baacaf
tags:
    - attack.credential_access
    - attack.t1003 # an old one
    - attack.t1003.002
    - attack.t1003.003

