title: Sysmon Driver Unload
description: Detect possible Sysmon driver unload
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
author: Kirill Kiryanov, oscd.community
date: 2019/10/23
modified: 2020/08/29

logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\fltmc.exe'
        CommandLine|contains|all:
            - 'unload'
            - 'sys'
    condition: selection

id: 4d7cda18-1b12-4e52-b45c-d28653210df8
tags:
    - attack.defense_evasion
    - attack.t1070
fields:
    - CommandLine
    - Details

