title: Mouse Lock Credential Gathering
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate tool "Mouse Lock" as being used for both credential access and collection in security incidents.
level: medium
status: experimental
falsepositives:
    - Legitimate uses of Mouse Lock software
author: Cian Heasley
reference:
    - https://github.com/klsecservices/Publications/blob/master/Incident-Response-Analyst-Report-2020.pdf
    - https://sourceforge.net/projects/mouselock/
date: 2020/08/13

logsource:
    category: process_creation
detection:
    selection:
        - Product|contains: 'Mouse Lock'
        - Company|contains: 'Misc314'
        - CommandLine|contains: 'Mouse Lock_'
    condition: selection

id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
fields:
    - Product
    - Company
    - CommandLine
tags:
    - attack.collection
    - attack.credential_access
    - attack.t1056.002

