title: WMI Backdoor Exchange Transport Agent
description: Detects a WMi backdoor in Exchange Transport Agents via WMi event filters
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/cglyer/status/1182389676876980224
    - https://twitter.com/cglyer/status/1182391019633029120
author: Florian Roth
date: 2019/10/11

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\EdgeTransport.exe'
    condition: selection

id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
tags:
    - attack.persistence
    - attack.t1084 # an old one
    - attack.t1546.003

