title: WMIExec VBS Script
description: Detects suspicious file execution by wscript and cscript
level: critical
falsepositives:
    - Unlikely
references:
    - https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
author: Florian Roth
date: 2017/04/07

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\cscript.exe'
        CommandLine: '*.vbs /shell *'
    condition: selection

id: 966e4016-627f-44f7-8341-f394905c361f
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.g0045
    - attack.t1059.005
    - attack.t1064 # an old one

