title: Netsh Port Forwarding
description: Detects netsh commands that configure a port forwarding
level: medium
status: experimental
falsepositives:
    - Legitimate administration
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
author: Florian Roth
date: 2019/01/29

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - netsh interface portproxy add v4tov4 *
    condition: selection

id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
modified: 2020/09/01
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.lateral_movement
    - attack.t1090

