title: Suspicious Netsh DLL Persistence
description: Detects persitence via netsh helper
level: high
status: testing
falsepositives:
    - Unknown
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1128/T1128.md
author: Victor Sergeev, oscd.community
date: 2019/10/25

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\netsh.exe'
        CommandLine|contains|all:
            - 'add'
            - 'helper'
    condition: selection

id: 56321594-9087-49d9-bf10-524fe8479452
modified: 2020/08/30
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
tags:
    - attack.persistence
    - attack.s0108
    - attack.t1128 # an old one
    - attack.t1546.007

