title: Firewall Disabled via Netsh
description: Detects netsh commands that turns off the Windows firewall
level: medium
status: experimental
falsepositives:
    - Legitimate administration
references:
    - https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
    - https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
author: Fatih Sirin
date: 2019/11/01
modified: 2020/08/30

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - netsh firewall set opmode mode=disable
            - netsh advfirewall set * state off
    condition: selection

id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
tags:
    - attack.defense_evasion
    - attack.s0108
    - attack.t1562.004

