title: Psr.exe Capture Screenshots
description: The psr.exe captures desktop screenshots and saves them on the local machine
level: medium
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Psr.yml
    - https://www.sans.org/summit-archives/file/summit-archive-1493861893.pdf
author: Beyu Denis, oscd.community
date: 2019/10/12

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\Psr.exe'
        CommandLine|contains: '/start'
    condition: selection

id: 2158f96f-43c2-43cb-952a-ab4580f32382
modified: 2020/08/28
tags:
    - attack.collection
    - attack.t1113

