title: Certutil Encode
description: Detects suspicious a certutil command that used to encode files, which is sometimes used for data exfiltration
level: medium
status: experimental
falsepositives:
    - unknown
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
author: Florian Roth
date: 2019/02/24

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - certutil -f -encode *
            - certutil.exe -f -encode *
            - certutil -encode -f *
            - certutil.exe -encode -f *
    condition: selection

id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
modified: 2020/09/05
tags:
    - attack.defense_evasion
    - attack.t1027

