title: PsExec Service Start
description: Detects a PsExec service start
level: low
falsepositives:
    - Administrative activity
author: Florian Roth
date: 2018/03/13

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: C:\Windows\PSEXESVC.exe
    condition: selection

id: 3ede524d-21cc-472d-a3ce-d21b568d8db7
modified: 2012/12/11
tags:
    - attack.execution
    - attack.s0029
    - attack.t1035 # an old one
    - attack.t1569.002

