title: MsiExec Web Install
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
description: Detects suspicious msiexec process starts with web addreses as parameter
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '* msiexec*://*'
    condition: selection
references:
    - https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1105
    - attack.t1218.007
author: Florian Roth
date: 2018/02/09
modified: 2020/08/30
level: medium
status: experimental
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment

