title: Suspicious Svchost Process
description: Detects a suspicious svchost process start
level: high
status: experimental
falsepositives:
    - Unknown
author: Florian Roth
date: 2017/08/15

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\svchost.exe'
    filter:
        ParentImage:
            - '*\services.exe'
            - '*\MsMpEng.exe'
            - '*\Mrt.exe'
            - '*\rpcnet.exe'
            - '*\svchost.exe'
    filter_null:
        ParentImage: null
    condition: selection and not filter and not filter_null

id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
modified: 2020/08/28
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.defense_evasion
    - attack.t1036 # an old one
    - attack.t1036.005

