title: Possible Shim Database Persistence via sdbinst.exe
description: Detects installation of a new shim using sdbinst.exe. A shim can be used to load malicious DLLs into applications.
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
author: Markus Neis
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\sdbinst.exe'
        CommandLine:
            - '*.sdb*'
    condition: selection

id: 517490a7-115a-48c6-8862-1a481504d5a8
modified: 2020/09/06
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1138 # an old one
    - attack.t1546.011

