title: Copy from Admin Share
description: Detects a suspicious copy command from a remote C$ or ADMIN$ share
level: high
status: experimental
falsepositives:
    - Administrative scripts
references:
    - https://twitter.com/SBousseaden/status/1211636381086339073
author: Florian Roth
date: 2019/12/30

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'copy *\c$'
            - 'copy *\ADMIN$'
    condition: selection

id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
modified: 2020/09/05
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.command_and_control
    - attack.lateral_movement
    - attack.s0106
    - attack.t1021.002
    - attack.t1077 # an old one
    - attack.t1105

