title: Fireball Archer Install
description: Detects Archer malware invocation via rundll32
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://www.virustotal.com/en/file/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022/analysis/
    - https://www.hybrid-analysis.com/sample/9b4971349ae85aa09c0a69852ed3e626c954954a3927b3d1b6646f139b930022?environmentId=100
author: Florian Roth
date: 2017/06/03
modified: 2020/08/29

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*\rundll32.exe *,InstallArcherSvc'
    condition: selection

id: 3d4aebe0-6d29-45b2-a8a4-3dfde586a26d
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1085 # an old one
    - attack.t1218.011

