title: Suspicious Userinit Child Process
description: Detects a suspicious child process of userinit
level: medium
status: experimental
falsepositives:
    - Administrative scripts
references:
    - https://twitter.com/SBousseaden/status/1139811587760562176
author: Florian Roth (rule), Samir Bousseaden (idea)
date: 2019/06/17

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\userinit.exe'
    filter1:
        CommandLine: '*\\netlogon\\*'
    filter2:
        Image: '*\explorer.exe'
    condition: selection and not filter1 and not filter2
fields:
    - CommandLine
    - ParentCommandLine

id: b655a06a-31c0-477a-95c2-3726b83d649d

