title: Microsoft Workflow Compiler
description: Detects invocation of Microsoft Workflow Compiler, which may permit the execution of arbitrary unsigned code.
level: high
status: experimental
falsepositives:
    - Legitimate MWC use (unlikely in modern enterprise environments)
references:
    - https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
author: Nik Seetharaman
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\Microsoft.Workflow.Compiler.exe'
    condition: selection

id: 419dbf2b-8a9b-4bea-bf99-7544b050ec8d
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1127

