title: Taskmgr as LOCAL_SYSTEM
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
level: high
status: experimental
falsepositives:
    - Unkown
author: Florian Roth
date: 2018/03/18

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        User: NT AUTHORITY\SYSTEM
        Image: '*\taskmgr.exe'
    condition: selection

id: 9fff585c-c33e-4a86-b3cd-39312079a65f
tags:
    - attack.defense_evasion
    - attack.t1036

