title: Encoded IEX
description: Detects a base64 encoded IEX command string in a process command line
level: critical
status: experimental
falsepositives:
    - unknown
author: Florian Roth
date: 2019/08/23

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|base64offset|contains:
            - 'IEX (['
            - 'iex (['
            - 'iex (New'
            - 'IEX (New'
    condition: selection

id: 88f680b8-070e-402c-ae11-d2914f2257f1
modified: 2020/08/29
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1086 # an old one

