title: WSF/JSE/JS/VBA/VBE File Execution
description: Detects suspicious file execution by wscript and cscript
level: medium
status: experimental
falsepositives:
    - Will need to be tuned. I recommend adding the user profile path in CommandLine if it is getting too noisy.
author: Michael Haag
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
        CommandLine|contains:
            - '.jse'
            - '.vbe'
            - '.js'
            - '.vba'
    condition: selection

id: 1e33157c-53b1-41ad-bbcc-780b80b58288
modified: 2020/08/28
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
    - attack.t1064 # an old one     

