title: Windows Defender Download Activity
description: Detect the use of Windows Defender to download payloads
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://twitter.com/djmtshepana/status/1301608169496612866
    - https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
author: Matthew Matchen
date: 2020/09/04

logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        - CommandLine|contains: 'MpCmdRun.exe'
        - Description: 'Microsoft Malware Protection Command Line Utility'
    selection2:
        CommandLine|contains|all:
            - 'DownloadFile'
            - 'url'
    condition: selection1 and selection2

id: 46123129-1024-423e-9fae-43af4a0fa9a5
fields:
    - CommandLine
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1105
    - attack.t1218.010

