title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
description: Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)
level: high
status: experimental
falsepositives:
    - NTDS maintenance
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
author: Thomas Patzke
date: 2019/01/16

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*\ntdsutil*'
    condition: selection

id: 2afafd61-6aae-4df4-baed-139fa1f4c345
tags:
    - attack.credential_access
    - attack.t1003 # an old one    
    - attack.t1003.003

