title: Remote PowerShell Session
description: Detects remote PowerShell connections by monitoring network outbount connections to ports 5985 or 5986 from not network service account
level: high
status: experimental
falsepositives:
    - Leigitmate usage of remote PowerShell, e.g. remote administration and monitoring.
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
modified: 2020/08/24

logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationPort:
            - 5985
            - 5986
    filter:
        User: 'NT AUTHORITY\NETWORK SERVICE'
    condition: selection and not filter

id: c539afac-c12a-46ed-b1bd-5a5567c9f045
tags:
    - attack.execution
    - attack.lateral_movement
    - attack.t1021.006
    - attack.t1028 # an old one
    - attack.t1059.001
    - attack.t1086 # an old one

