title: RDP Over Reverse SSH Tunnel
description: Detects svchost hosting RDP termsvcs communicating with the loopback address and on TCP port 3389
level: high
status: experimental
falsepositives:
    - unknown
references:
    - https://twitter.com/SBousseaden/status/1096148422984384514
author: Samir Bousseaden
date: 2019/02/16

logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image: '*\svchost.exe'
        Initiated: 'true'
        SourcePort: 3389
        DestinationIp:
            - '127.*'
            - '::1'
    condition: selection

id: 5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4
modified: 2020/08/24
tags:
    - attack.command_and_control
    - attack.lateral_movement
    - attack.t1021.001
    - attack.t1076 # an old one
    - attack.t1572
    - car.2013-07-002

