title: Rare Scheduled Task Creations
description: This rule detects rare scheduled task creations. Typically software gets installed on multiple systems and not only on a few. The aggregation and count function selects tasks with rare names.
level: low
status: experimental
falsepositives:
    - Software installation
author: Florian Roth
date: 2017/03/17

logsource:
    product: windows
    service: taskscheduler
detection:
    selection:
        EventID: 106
    condition: selection | count() by TaskName < 5
    timeframe: 7d

id: b20f6158-9438-41be-83da-a5a16ac90c2b
tags:
    - attack.persistence
    - attack.s0111
    - attack.t1053 # an old one
    - attack.t1053.005

