title: Windows Defender Threat Detected
description: Detects all actions taken by Windows Defender malware detection engines
level: high
status: stable
falsepositives:
    - unlikely
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
author: Ján Trenčanský
date: 2020/07/28

logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID:
            - 1006
            - 1116
            - 1015
            - 1117
    condition: selection

id: 57b649ef-ff42-4fb0-8bf6-62da243a1708

