title: Windows Defender AMSI Trigger Detected
description: Detects triggering of AMSI by Windows Defender.
level: high
status: stable
falsepositives:
    - unlikely
references:
    - https://docs.microsoft.com/en-us/windows/win32/amsi/how-amsi-helps
author: Bhabesh Raj
date: 2020/09/14

logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1116
        DetectionSource: 'AMSI'
    condition: selection

id: ea9bf0fa-edec-4fb8-8b78-b119f2528186

