title: COM Hijack via Sdclt
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
level: high
status: experimental
falsepositives:
    - unknown
references:
    - http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
    - https://www.exploit-db.com/exploits/47696
author: Omkar Gudhate
date: 2020/09/27

logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject:
            - 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
        EventType:
            - SetValue
    condition: selection

id: 07743f65-7ec9-404a-a519-913db7118a8d
tags:
    - attack.privilege_escalation
    - attack.t1546
    - attack.t1548

