title: Security Support Provider (SSP) Added to LSA Configuration
description: Detects the addition of a SSP to the registry. Upon a reboot or API call, SSP DLLs gain access to encrypted and plaintext passwords stored in Windows.
level: critical
status: experimental
falsepositives:
    - Unlikely
references:
    - https://attack.mitre.org/techniques/T1101/
    - https://powersploit.readthedocs.io/en/latest/Persistence/Install-SSP/
author: iwillkeepwatch
date: 2019/01/18

logsource:
    category: registry_event
    product: windows
detection:
    selection_registry:
        TargetObject:
            - 'HKLM\System\CurrentControlSet\Control\Lsa\Security Packages'
            - 'HKLM\System\CurrentControlSet\Control\Lsa\OSConfig\Security Packages'
    exclusion_images:
        - Image: C:\Windows\system32\msiexec.exe
        - Image: C:\Windows\syswow64\MsiExec.exe
    condition: selection_registry and not exclusion_images

id: eeb30123-9fbd-4ee8-aaa0-2e545bbed6dc
modified: 2020/09/06
tags:
    - attack.persistence
    - attack.t1101 # an old one
    - attack.t1547.005

