title: RedMimicry Winnti Playbook Registry Manipulation
description: Detects actions caused by the RedMimicry Winnti playbook
level: high
falsepositives:
    - Unknown
references:
    - https://redmimicry.com
author: Alexander Rausch
date: 2020/06/24

logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: HKLM\SOFTWARE\Microsoft\HTMLHelp\data
    condition: selection

id: 5b175490-b652-4b02-b1de-5b5b4083c5f8
tags:
    - attack.defense_evasion
    - attack.t1112

