title: Registry Persistence Mechanisms
description: Detects persistence registry keys
level: critical
falsepositives:
    - unknown
references:
    - https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
author: Karneades
date: 2018/04/11
modified: 2020/09/06

logsource:
    category: registry_event
    product: windows
detection:
    selection_reg1:
        TargetObject:
            - '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\\*\GlobalFlag'
            - '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SilentProcessExit\\*\ReportingMode'
            - '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SilentProcessExit\\*\MonitorProcess'
        EventType: SetValue
    condition: selection_reg1

id: 36803969-5421-41ec-b92f-8500f79c23b0
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1183 # an old one
    - attack.t1546.012
    - car.2013-01-002

