title: Leviathan Registry Key Activity
description: Detects registry key used by Leviathan APT in Malaysian focused campaign
level: critical
status: experimental
references:
    - https://www.elastic.co/blog/advanced-techniques-used-in-malaysian-focused-apt-campaign
author: Aidan Bracher
date: 2020/07/07

logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject: 'HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run\ntkd'
    condition: selection

id: 70d43542-cd2d-483c-8f30-f16b436fd7db
modified: 2020/09/06
tags:
    - attack.persistence
    - attack.t1060 # an old one
    - attack.t1547.001

