title: Disable Security Events Logging Adding Reg Key MiniNt
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot, Windows Event Log service will stopped write events.
level: high
status: experimental
falsepositives:
    - Unkown
references:
    - https://twitter.com/0gtweet/status/1182516740955226112
author: Ilyas Ochkov, oscd.community
date: 2019/10/25

logsource:
    category: registry_event
    product: windows
detection:
    selection:
        - # Sysmon gives us HKLM\SYSTEM\CurrentControlSet\.. if ControlSetXX is the selected one
          TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Control\MiniNt'
          EventType: 'CreateKey' # we don't want deletekey
        - # key rename
          NewName: 'HKLM\SYSTEM\CurrentControlSet\Control\MiniNt'
    condition: selection

id: 919f2ef0-be2d-4a7a-b635-eb2b41fde044
modified: 2019/11/13
fields:
    - EventID
    - Image
    - TargetObject
    - NewName
tags:
    - attack.defense_evasion
    - attack.t1089 # an old one
    - attack.t1112
    - attack.t1562.001

