title: New RUN Key Pointing to Suspicious Folder
description: Detects suspicious new RUN key element pointing to an executable in a suspicious folder
level: high
status: experimental
falsepositives:
    - Software using weird folders for updates
references:
    - https://www.fireeye.com/blog/threat-research/2018/08/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation.html
author: Florian Roth, Markus Neis, Sander Wiebing
date: 2018/08/25

logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject:
            - '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\\*'
            - '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\\*'
        Details:
            - '*C:\Windows\Temp\\*'
            - '*C:\$Recycle.bin\\*'
            - '*C:\Temp\\*'
            - '*C:\Users\Public\\*'
            - '%Public%\\*'
            - '*C:\Users\Default\\*'
            - '*C:\Users\Desktop\\*'
            - 'wscript*'
            - 'cscript*'
    condition: selection

id: 02ee49e2-e294-4d0f-9278-f5b3212fc588
modified: 2020/09/06
fields:
    - Image
tags:
    - attack.persistence
    - attack.t1060 # an old one
    - attack.t1547.001

