title: Executable from Webdav
id: aac2fd97-bcba-491b-ad66-a6edf89c71bf
description: "Detects executable access via webdav6. Can be seen in APT 29 such as from the emulated APT 29 hackathon https://github.com/OTRF/detection-hackathon-apt29/"
author: 'SOC Prime, Adam Swan'

logsource:
    product: zeek
    service: http
detection:
    selection_webdav:
        - c-useragent: '*WebDAV*'
        - c-uri: '*webdav*'
    selection_executable:
        - resp_mime_types: '*dosexec*'
        - c-uri: '*.exe'
    condition: selection_webdav AND selection_executable

references:
    - http://carnal0wnage.attackresearch.com/2012/06/webdav-server-to-download-custom.html
    - https://github.com/OTRF/detection-hackathon-apt29
date: 2020/05/01
modified: 2020/09/02
tags:
    - attack.command_and_control
    - attack.t1105
level: medium
status: experimental
falsepositives:
    - unknown

