title: Suspicious PsExec Execution - Zeek
description: detects execution of psexec or paexec with renamed service name, this rule helps to filter out the noise if psexec is used for legit purposes or if attacker uses a different psexec client other than sysinternal one
level: high
falsepositives:
    - nothing observed so far
references:
    - https://github.com/neo23x0/sigma/blob/d42e87edd741dd646db946f30964f331f92f50e6/rules/windows/builtin/win_susp_psexec.yml
author: 'Samir Bousseaden, @neu5ron'
date: 2020/04/02

logsource:
    product: zeek
    service: smb_files
detection:
    selection1:
        path: \\*\IPC$
        name:
            - '*-stdin'
            - '*-stdout'
            - '*-stderr'
    selection2:
        name: \\*\IPC$
        path: 'PSEXESVC*'
    condition: selection1 and not selection2

id: f1b3a22a-45e6-4004-afb5-4291f9c21166
tags:
    - attack.lateral_movement
    - attack.t1021.002
    - attack.t1077 # an old one

