title: CobaltStrike Malleable (OCSP) Profile
id: 37325383-740a-403d-b1a2-b2b4ab7992e7
description: Detects Malleable (OCSP) Profile with Typo (OSCP) in URL
author: Markus Neis
date: 2019/11/12
modified: 2020/09/02
logsource:
    category: proxy
detection:
    selection:
        c-uri: '*/oscp/*'
        cs-host: 'ocsp.verisign.com'

    condition: selection
references:
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/ocsp.profile
tags:
    - attack.defense_evasion
    - attack.command_and_control
    - attack.t1071.001
    - attack.t1043 # an old one
level: high
status: experimental
falsepositives:
    - Unknown

