title: PwnDrp Access
description: Detects downloads from PwnDrp web servers developed for red team testing and most likely also used for criminal activity
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://breakdev.org/pwndrop/
author: Florian Roth
date: 2020/04/15
modified: 2020/09/03

logsource:
    category: proxy
detection:
    selection:
        c-uri|contains: '/pwndrop/'
    condition: selection
fields:
    - ClientIP
    - c-uri
    - c-useragent

id: 2b1ee7e4-89b6-4739-b7bb-b811b6607e5e
tags:
    - attack.command_and_control
    - attack.t1043 # an old one
    - attack.t1071.001
    - attack.t1102 # an old one
    - attack.t1102.001
    - attack.t1102.003

