title: CobaltStrike Malleable (OCSP) Profile
description: Detects Malleable (OCSP) Profile with Typo (OSCP) in URL
level: high
status: experimental
falsepositives:
    - Unknown
references:
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/ocsp.profile
author: Markus Neis
date: 2019/11/12
modified: 2020/09/02

logsource:
    category: proxy
detection:
    selection:
        c-uri: '*/oscp/*'
        cs-host: 'ocsp.verisign.com'
    condition: selection

id: 37325383-740a-403d-b1a2-b2b4ab7992e7
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1043 # an old one
    - attack.t1071.001

