title: Empire UserAgent URI Combo
description: Detects user agent and URI paths used by empire agents
level: high
status: experimental
falsepositives:
    - Valid requests with this exact user agent to server scripts of the defined names
references:
    - https://github.com/BC-SECURITY/Empire
author: Florian Roth
date: 2020/07/13
modified: 2020/09/03

logsource:
    category: proxy
detection:
    selection:
        c-useragent: 'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko'
        cs-uri-query:
            - '/admin/get.php'
            - '/news.php'
            - '/login/process.php'
        cs-method: 'POST'
    condition: selection
fields:
    - c-uri
    - c-ip

id: b923f7d6-ac89-4a50-a71a-89fb846b4aa8
tags:
    - attack.command_and_control
    - attack.defense_evasion
    - attack.t1043 # an old one
    - attack.t1071.001

