title: IOS Implant URL Pattern
description: Detects URL pattern used by iOS Implant
level: critical
status: experimental
falsepositives:
    - Unknown
references:
    - https://googleprojectzero.blogspot.com/2019/08/implant-teardown.html
    - https://twitter.com/craiu/status/1167358457344925696
author: Florian Roth
date: 2019/08/30
modified: 2020/09/03

logsource:
    category: proxy
detection:
    selection:
        c-uri: '*/list/suc?name=*'
    condition: selection
fields:
    - ClientIP
    - c-uri
    - c-useragent

id: e06ac91d-b9e6-443d-8e5b-af749e7aa6b6
tags:
    - attack.collection
    - attack.credential_access
    - attack.execution
    - attack.t1005
    - attack.t1081 # an old one
    - attack.t1119
    - attack.t1203
    - attack.t1528
    - attack.t1552.001

