title: Spring Framework Exceptions
id: ae48ab93-45f7-4051-9dfe-5d30a3f78e33
description: Detects suspicious Spring framework exceptions that could indicate exploitation attempts
author: Thomas Patzke
date: 2017/08/06
modified: 2020/09/01
logsource:
    category: application
    product: spring
detection:
    keywords:
        - AccessDeniedException
        - CsrfException
        - InvalidCsrfTokenException
        - MissingCsrfTokenException
        - CookieTheftException
        - InvalidCookieException
        - RequestRejectedException
    condition: keywords
references:
    - https://docs.spring.io/spring-security/site/docs/current/apidocs/overview-tree.html
tags:
    - attack.initial_access
    - attack.t1190
level: medium
status: stable
falsepositives:
    - Application bugs
    - Penetration testing

