title: Python SQL Exceptions
id: 19aefed0-ffd4-47dc-a7fc-f8b1425e84f9
description: Generic rule for SQL exceptions in Python according to PEP 249
author: Thomas Patzke
date: 2017/08/12
modified: 2020/09/01

logsource:
    category: application
    product: python
detection:
    exceptions:
        - DataError
        - IntegrityError
        - ProgrammingError
        - OperationalError
    condition: exceptions

references:
    - https://www.python.org/dev/peps/pep-0249/#exceptions
tags:
    - attack.initial_access
    - attack.t1190
level: medium
status: stable
falsepositives:
    - Application bugs
    - Penetration testing

