title: Network Scans
description: Detects many failed connection attempts to different ports or hosts
level: medium
status: experimental
falsepositives:
    - Inventarization systems
    - Vulnerability scans
    - Penetration testing activity
author: Thomas Patzke
date: 2017/02/19
modified: 2020/08/27

logsource:
    category: firewall
detection:
    selection:
        action: denied
    condition:
        - selection | count(dst_port) by src_ip > 10
        - selection | count(dst_ip) by src_ip > 10
    timeframe: 24h
fields:
    - src_ip
    - dst_ip
    - dst_port

id: fab0ddf0-b8a9-4d70-91ce-a20547209afb
tags:
    - attack.discovery
    - attack.t1046

