title: Possible DNS Tunneling
description: Normally, DNS logs contain a limited amount of different dns queries for a single domain. This rule detects a high amount of queries for a single domain, which can be an indicator that DNS is used to transfer data.
level: high
status: experimental
falsepositives:
    - Valid software, which uses dns for transferring data
references:
    - https://zeltser.com/c2-dns-tunneling/
    - https://patrick-bareiss.com/detect-c2-traffic-over-dns-using-sigma/
author: Patrick Bareiss
date: 2019/04/07
modified: 2020/08/27

logsource:
    category: dns
detection:
    selection:
        parent_domain: '*'
    condition: selection | count(dns_query) by parent_domain > 1000

id: 1ec4b281-aa65-46a2-bdae-5fd830ed914e
tags:
    - attack.command_and_control
    - attack.exfiltration
    - attack.t1048 # an old one
    - attack.t1048.003
    - attack.t1071 # an old one
    - attack.t1071.004

