title: Restore Public AWS RDS Instance
description: Detects the recovery of a new public database instance from a snapshot. It may be a part of data exfiltration.
level: high
status: experimental
falsepositives:
    - unknown
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/master/modules/rds__explore_snapshots/main.py#L10
author: faloker
date: 2020/02/12
modified: 2020/09/01

logsource:
    service: cloudtrail
detection:
    selection_source:
        - eventSource: rds.amazonaws.com
    selection_ispublic:
        - responseElements.publiclyAccessible: "true"
    selection_eventname:
        - eventName: RestoreDBInstanceFromDBSnapshot
    condition: all of them

id: c3f265c7-ff03-4056-8ab2-d486227b4599
tags:
    - attack.exfiltration
    - attack.t1020

